emacs/lsp-java/setupJava8Project.org
* Emacs lsp-java Configure Java 8 Project With jdtls Which Runs Only on Java 11 or Above

The latest jdtls runs only on Java 11 or above, but many project still use Java 8, the article show you how to configure emacs lsp-java to use Java 8 for your project with the latest jdtls. Two variables will be used ~lsp-java-java-path~ and ~lsp-java-configuration-runtimes~
** Set ~lsp-java-java-path~ to where to look for Java 11, for instance, add the following to your init.el
#+BEGIN_SRC emacs-lisp
(setq lsp-java-java-path "/usr/bin/java")
#+END_SRC
** Set ~lsp-java-configuration-runtimes~, for instance, and the following to your init.el
#+BEGIN_SRC emacs-lisp
(setq lsp-java-configuration-runtimes '[(:name "JavaSE-1.8"
						                       :path "/usr/local/jdk1.8.0_202" :default t) ;; use Java 8 for your project
                                      (:name "JavaSE-11" :path "/usr/lib/jvm/java-11-openjdk-amd64")
					])
#+END_SRC
Have a look at =~/.emacs.d/workspace/.metadata/.plugins/org.eclipse.jdt.launching/libraryInfos.xml=. If you updated your local java path and want LSP to use the new version, try removing the ~/.emacs.d/workspace/ directory and relaunch LSP.

** Reference
[[https://github.com/emacs-lsp/lsp-java][lsp-java github home page]]
